app/controllers/home_controller.rb

SELECT COUNT(*) FROM `balance_bills` WHERE (`balance_bills`.`status` NOT IN ('Deleted','Archived')) AND (`balance_bills`.`balance_status` IN ('Initiated','Ready'))
---
  def index
    authorize! :manage, :home
    reset_session

    # base system stats
    @base = Hash.new
    @base[:patients]  = Patient.count
    @base[:groups]    = Group.count
    @base[:providers] = Provider.count

    # session billing stats
    @claims = Hash.new
    #ins billing claims
    # claims in the initial state do not have a stand alone view in ins billing, processing or eob controllers.
    # the view for claims in initial state will be under the home controller, since this is the only controller utilizing the view
    @claims[:initiated]     = InsuranceBilling.initial.count
    @claims[:ready]         = InsuranceBilling.pending.count
    @claims[:processed]     = InsuranceBilling.processed.count
    @claims[:agedprocessed]  = InsuranceBilling.aged_processed(15.days.ago).count
    @claims[:agedprocessed2] = InsuranceBilling.aged_processed(30.days.ago).count
    @claims[:agedprocessed3] = InsuranceBilling.aged_processed(45.days.ago).count
    # posted and unassigned EOBs
    @claims[:assigned]      = Eob.assigned.count
    @claims[:unassigned]    = Eob.unassigned.count

    #balance billing stats
    @balance = Hash.new
    @balance[:not_sent]     = BalanceBill.without_status(:deleted, :archived).with_balance_status(:initiated, :ready).count