app/controllers/reporting_controller.rb

  def index
    @reporting = Reporting.without_status(:deleted).all
---
SELECT `reportings`.* FROM `reportings` WHERE (`reportings`.`status` NOT IN ('Deleted'))

  def ajax_category
    case params[:category]
      when Reporting::ALL
        @query_hash = {:category_all => true}
      when Reporting::PROVIDER
        @query_hash = {:category_provider => true}
      when Reporting::PATIENT
        @query_hash = {:category_patient => true}
      when Reporting::CLAIM
        @query_hash = {:category_claim => true}
      when Reporting::BALANCE
        @query_hash = {:category_balance => true}
      when Reporting::INVOICES
        @query_hash = {:category_invoice => true}
      when Reporting::USER
        @query_hash = {:category_user => true}
      when Reporting::SYSTEM
        @query_hash = {:category_system => true}
    end
    @reporting = Reporting.without_status(:deleted).where(@query_hash)
---
SELECT `reportings`.* FROM `reportings` WHERE `reportings`.`category_provider` = 1 AND (`reportings`.`status` NOT IN ('Deleted'))
SELECT `users`.* FROM `users` WHERE `users`.`deleted` = 0 AND `users`.`id` = 4 LIMIT 1