app/controllers/users_controller.rb

INSERT INTO `users` (`ability_admin`, `ability_invoice`, `ability_superadmin`, `cell_phone`, `created_at`, `created_user`, `current_sign_in_at`, `current_sign_in_ip`, `deleted`, `email`, `encrypted_password`, `first_name`, `home_phone`, `last_name`, `last_sign_in_at`, `last_sign_in_ip`, `login_name`, `perm`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `sign_in_count`, `status`, `updated_at`, `updated_user`) VALUES (1, 1, 0, '', '2014-01-06 19:59:50', 'admin', NULL, NULL, 0, 'peter.maxcy@gmail.com', '$2a$10$FKG8L/cMqbUJnZ4A/xbi/OfKJ2MLQeEi7NgsY3hokaPryJZKvRJ9e', 'Peter', '', 'Maxcy', NULL, NULL, 'maxcyp', 0, NULL, NULL, NULL, 0, NULL, '2014-01-06 19:59:50', NULL)
---
  def create
    @user = User.new(params[:user])
    @user.created_user = current_user.login_name